tests/test_data/ibkr/For_tax_automation.xml

<FlexQueryResponse queryName="For tax automation" type="AF">
<FlexStatements count="1">
<FlexStatement accountId="-" fromDate="2024-01-01" toDate="2024-12-31" period="" whenGenerated="2025-01-05 15:43:52">
<Trades>
</Trades><CorporateActions>
<CorporateAction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="BILL" subCategory="" symbol="912797MN4" description="(US912797MN44) TBILL MATURITY (912797MN4, B 12/10/24, US912797MN44)" conid="721324301" securityID="US912797MN44" securityIDType="ISIN" cusip="912797MN4" isin="US912797MN44" figi="" listingExchange="" underlyingConid="" underlyingSymbol="BILL" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" reportDate="2024-12-10" dateTime="2024-12-09 20:25:00" actionDescription="(US912797MN44) TBILL MATURITY (912797MN4, B 12/10/24, US912797MN44)" amount="-5000" proceeds="5000" value="0" quantity="-5000" fifoPnlRealized="76.64" mtmPnl="0.6341" code="" type="TM" transactionID="3397516646" actionID="144672201" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CorporateAction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="BOND" subCategory="Govt" symbol="T 1 1/2 11/30/24" description="(US912828YV68) FULL CALL / EARLY REDEMPTION FOR USD 1.00 PER BOND (T 1 1/2 11/30/24, T 1 1/2 11/30/24, US912828YV68)" conid="393523672" securityID="US912828YV68" securityIDType="ISIN" cusip="912828YV6" isin="US912828YV68" figi="BBG00QYMYVP3" listingExchange="" underlyingConid="" underlyingSymbol="T" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="1" reportDate="2024-12-02" dateTime="2024-11-29 20:25:00" actionDescription="(US912828YV68) FULL CALL / EARLY REDEMPTION FOR USD 1.00 PER BOND (T 1 1/2 11/30/24, T 1 1/2 11/30/24, US912828YV68)" amount="-4000" proceeds="4000" value="0" quantity="-4000" fifoPnlRealized="100.92" mtmPnl="-0.625" code="" type="BM" transactionID="3362463947" actionID="144488888" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />

<CorporateAction accountId="Dumb record outside of processed date range expected to be filtered out and have 0 impact on final results" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="BILL" subCategory="" symbol="912797GK7" description="(US912797GK78) TBILL MATURITY (912797GK7, B 08/08/24, US912797GK78)" conid="647201829" securityID="US912797GK78" securityIDType="ISIN" cusip="912797GK7" isin="US912797GK78" figi="" listingExchange="" underlyingConid="" underlyingSymbol="" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" reportDate="2025-08-07" dateTime="2024-08-06 20:25:00" actionDescription="(US912797GK78) TBILL MATURITY (912797GK7, B 08/08/24, US912797GK78)" amount="-4000" proceeds="4000" value="0" quantity="-4000" fifoPnlRealized="300" mtmPnl="1.1672" code="" type="TM" transactionID="792339292" actionID="139966569" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
</CorporateActions><CashTransactions>
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="REIT" symbol="O" description="O(US7561091049) CASH DIVIDEND USD 0.2635 PER SHARE (Ordinary Dividend)" conid="10672" securityID="US7561091049" securityIDType="ISIN" cusip="756109104" isin="US7561091049" figi="BBG000DHPN63" listingExchange="NYSE" underlyingConid="" underlyingSymbol="O" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-10-15 20:20:00" settleDate="2024-10-15" availableForTradingDate="" amount="5.53" type="Dividends" tradeID="" code="" transactionID="3186001433" reportDate="2024-10-15" exDate="2024-10-01" clientReference="" actionID="143048141" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="REIT" symbol="O" description="O(US7561091049) CASH DIVIDEND USD 0.2635 PER SHARE - US TAX" conid="10672" securityID="US7561091049" securityIDType="ISIN" cusip="756109104" isin="US7561091049" figi="BBG000DHPN63" listingExchange="NYSE" underlyingConid="" underlyingSymbol="O" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-10-15 20:20:00" settleDate="2024-10-15" availableForTradingDate="" amount="-0.83" type="Withholding Tax" tradeID="" code="" transactionID="3186001434" reportDate="2024-10-15" exDate="" clientReference="" actionID="143048141" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="COMMON" symbol="MA" description="MA(US57636Q1040) CASH DIVIDEND USD 0.66 PER SHARE - US TAX" conid="38685693" securityID="US57636Q1040" securityIDType="ISIN" cusip="57636Q104" isin="US57636Q1040" figi="BBG000F1ZSQ2" listingExchange="NYSE" underlyingConid="" underlyingSymbol="MA" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-11-08 20:20:00" settleDate="2024-11-08" availableForTradingDate="" amount="-0.1" type="Withholding Tax" tradeID="" code="" transactionID="3280241925" reportDate="2024-11-08" exDate="" clientReference="" actionID="143291047" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="COMMON" symbol="MA" description="MA(US57636Q1040) CASH DIVIDEND USD 0.66 PER SHARE (Ordinary Dividend)" conid="38685693" securityID="US57636Q1040" securityIDType="ISIN" cusip="57636Q104" isin="US57636Q1040" figi="BBG000F1ZSQ2" listingExchange="NYSE" underlyingConid="" underlyingSymbol="MA" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-11-08 20:20:00" settleDate="2024-11-08" availableForTradingDate="" amount="0.66" type="Dividends" tradeID="" code="" transactionID="3280241924" reportDate="2024-11-08" exDate="2024-10-09" clientReference="" actionID="143291047" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="COMMON" symbol="AAPL" description="AAPL(US0378331005) CASH DIVIDEND USD 0.25 PER SHARE - US TAX" conid="265598" securityID="US0378331005" securityIDType="ISIN" cusip="037833100" isin="US0378331005" figi="BBG000B9XRY4" listingExchange="NASDAQ" underlyingConid="" underlyingSymbol="AAPL" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-11-14 20:20:00" settleDate="2024-11-14" availableForTradingDate="" amount="-0.56" type="Withholding Tax" tradeID="" code="" transactionID="3302845848" reportDate="2024-11-14" exDate="" clientReference="" actionID="144833781" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="COMMON" symbol="AAPL" description="AAPL(US0378331005) CASH DIVIDEND USD 0.25 PER SHARE (Ordinary Dividend)" conid="265598" securityID="US0378331005" securityIDType="ISIN" cusip="037833100" isin="US0378331005" figi="BBG000B9XRY4" listingExchange="NASDAQ" underlyingConid="" underlyingSymbol="AAPL" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-11-14 20:20:00" settleDate="2024-11-14" availableForTradingDate="" amount="3.75" type="Dividends" tradeID="" code="" transactionID="3302845847" reportDate="2024-11-14" exDate="2024-11-08" clientReference="" actionID="144833781" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="ADR" symbol="UL" description="UL(US9047677045) CASH DIVIDEND USD 0.4755 PER SHARE (Ordinary Dividend)" conid="13246" securityID="US9047677045" securityIDType="ISIN" cusip="904767704" isin="US9047677045" figi="BBG000BW1442" listingExchange="NYSE" underlyingConid="" underlyingSymbol="UL" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="GB" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-12-06 20:20:00" settleDate="2024-12-06" availableForTradingDate="" amount="2.38" type="Dividends" tradeID="" code="" transactionID="3390293189" reportDate="2024-12-06" exDate="2024-11-08" clientReference="" actionID="144672048" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
<CashTransaction accountId="-" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="ADR" symbol="UL" description="UL(US9047677045) CASH DIVIDEND USD 0.4755 PER SHARE - FEE" conid="13246" securityID="US9047677045" securityIDType="ISIN" cusip="904767704" isin="US9047677045" figi="BBG000BW1442" listingExchange="NYSE" underlyingConid="" underlyingSymbol="UL" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="GB" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2024-12-06 20:20:00" settleDate="2024-12-06" availableForTradingDate="" amount="-0.03" type="Other Fees" tradeID="" code="" transactionID="3390293191" reportDate="2024-12-06" exDate="" clientReference="" actionID="" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />

<CashTransaction accountId="Dumb record outside of processed date range expected to be filtered out and have 0 impact on final results" acctAlias="" model="" currency="USD" fxRateToBase="1" assetCategory="STK" subCategory="COMMON" symbol="AAPL" description="AAPL(US0378331005) CASH DIVIDEND USD 0.25 PER SHARE - US TAX" conid="265598" securityID="US0378331005" securityIDType="ISIN" cusip="037833100" isin="US0378331005" figi="BBG000B9XRY4" listingExchange="NASDAQ" underlyingConid="" underlyingSymbol="AAPL" underlyingSecurityID="" underlyingListingExchange="" issuer="" issuerCountryCode="US" multiplier="1" strike="" expiry="" putCall="" principalAdjustFactor="" dateTime="2023-11-14 20:20:00" settleDate="2023-11-14" availableForTradingDate="" amount="-100" type="Withholding Tax" tradeID="" code="" transactionID="3302845848" reportDate="2023-11-14" exDate="" clientReference="" actionID="144833781" levelOfDetail="DETAIL" serialNumber="" deliveryType="" commodityType="" fineness="0.0" weight="0.0" />
</CashTransactions>
</FlexStatement>
</FlexStatements>
</FlexQueryResponse>